app/views/posts/index.html.erb

		<span>
			POST HAS <%= pluralize post.comments.count, 'comment' %>
---
SELECT COUNT(*) FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 1]]