app/controllers/comments_controller.rb

INSERT INTO "comments" ("message", "post_id", "title", "user_id") VALUES (?, ?, ?, ?)  [["message", "My Biba special for you 8="], ["post_id", 1], ["title", "This is my first comment"], ["user_id", 1]]
---
  def create
    puts params
    com = post.comments.new(comment_params)
    com.user = current_user

    if com.save