app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
	  def index
	   # instance param
	   @posts = Post.all

INSERT INTO "posts" ("body", "title", "user_id") VALUES (?, ?, ?)  [["body", "fkflf"], ["title", "fjf"], ["user_id", 1]]
---
	  def create
	  	puts params
	  	current_user.posts.create(post_params)

UPDATE "posts" SET "body" = ?, "title" = ? WHERE "posts"."id" = 4  [["body", "Success edit"], ["title", "Florex"]]
---
	  def update
	  	@post.assign_attributes(post_params)
	  	if @post.save